renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/9_CAN_driver/Examples/CAN_Example3_Transmission_using_Interrupts/Autosar/Mcal/Base/header/S32K144W_M4.svd
        <register>
          <name>HRS</name>
          <description>Hardware Request Status</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HRS0</name>
              <description>Hardware Request Status Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 0 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 0 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS1</name>
              <description>Hardware Request Status Channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 1 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 1 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS2</name>
              <description>Hardware Request Status Channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 2 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 2 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS3</name>
              <description>Hardware Request Status Channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 3 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 3 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS4</name>
              <description>Hardware Request Status Channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 4 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 4 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS5</name>
              <description>Hardware Request Status Channel 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 5 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 5 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS6</name>
              <description>Hardware Request Status Channel 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 6 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 6 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS7</name>
              <description>Hardware Request Status Channel 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 7 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 7 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS8</name>
              <description>Hardware Request Status Channel 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 8 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 8 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS9</name>
              <description>Hardware Request Status Channel 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 9 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 9 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS10</name>
              <description>Hardware Request Status Channel 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 10 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 10 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS11</name>
              <description>Hardware Request Status Channel 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 11 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 11 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS12</name>
              <description>Hardware Request Status Channel 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 12 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 12 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS13</name>
              <description>Hardware Request Status Channel 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 13 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 13 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS14</name>
              <description>Hardware Request Status Channel 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 14 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 14 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS15</name>
              <description>Hardware Request Status Channel 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HWRQST</name>
                  <description>A hardware service request for channel 15 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRQST</name>
                  <description>A hardware service request for channel 15 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
