renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/9_CAN_driver/Examples/CAN_Example3_Transmission_using_Interrupts/Autosar/Mcal/Base/header/S32K144W_M4.svd
        <register>
          <name>FCSESTAT1</name>
          <description>Flash CSEc Status Register 1</description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>BSY</name>
              <description>Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BSY_0</name>
                  <description>CSEc command processing has completed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BSY_1</name>
                  <description>CSEc command processing is in progress</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SB</name>
              <description>Secure Boot</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SB_0</name>
                  <description>Secure boot not activated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SB_1</name>
                  <description>Secure boot is activated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIN</name>
              <description>Secure Boot Initialization</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIN_0</name>
                  <description>Secure boot personalization not completed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIN_1</name>
                  <description>Secure boot personalization has completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BFN</name>
              <description>Secure Boot Finished</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BFN_0</name>
                  <description>Secure Boot is not finished</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BFN_1</name>
                  <description>Secure Boot has finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOK</name>
              <description>Secure Boot OK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOK_0</name>
                  <description>Secure boot is not complete, or secure boot failure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOK_1</name>
                  <description>Secure boot was successful</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RIN</name>
              <description>Random Number Generator Initialized</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RIN_0</name>
                  <description>Random number generator is not initialized</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIN_1</name>
                  <description>Random number generator is initialized</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDB</name>
              <description>External Debug</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDB_0</name>
                  <description>External debugger not attached</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDB_1</name>
                  <description>External debugger is attached</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDB</name>
              <description>Internal Debug</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDB_0</name>
                  <description>Internal debug functions are disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDB_1</name>
                  <description>Internal debugger functions are enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCSESTAT0</name>
          <description>Flash CSEc Status Register 0</description>
          <addressOffset>0x2D</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CMDTYPE</name>
              <description>Command Type</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMDTYPE_0</name>
                  <description>Flash command or no command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDTYPE_1</name>
                  <description>CSEc command</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMERR</name>
              <description>Memory Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEMERR_0</name>
                  <description>Uncorrectable ECC fault not detected, CSE_PRAM access not blocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEMERR_1</name>
                  <description>Uncorrectable ECC fault detected, CSE_PRAM access blocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FERSTAT</name>
          <description>Flash Error Status Register</description>
          <addressOffset>0x2E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF3</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>PDFDIF</name>
              <description>Platform FlexRAM Double Bit Fault Detect Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDFDIF_0</name>
                  <description>Fault not detected during a valid FlexRAM or CSE_PRAM read access from the platform flash controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDFDIF_1</name>
                  <description>Fault detected (or FERCNFG[PFDFD] is set) during a valid FlexRAM or CSE_PRAM read access from the platform flash controller</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFDIF</name>
              <description>Platform Flash Double Bit Fault Detect Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFDIF_0</name>
                  <description>Fault not detected during a valid flash read access from the platform flash controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFDIF_1</name>
                  <description>Fault detected (or FERCNFG[FDFD] is set) during a valid flash read access from the platform flash controller</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDFDIF</name>
              <description>Controller FlexRAM Double Bit Fault Detect Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDFDIF_0</name>
                  <description>Fault not detected during a valid FlexRAM or CSE_PRAM read access from the flash memory controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDFDIF_1</name>
                  <description>Fault detected (or FERCNFG[EFDFD] is set) during a valid FlexRAM or CSE_PRAM read access from the flash memory controller</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDFDIF</name>
              <description>Controller Flash Double Bit Fault Detect Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDFDIF_0</name>
                  <description>Fault not detected during a valid internal RAM or flash read access from the flash memory controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDFDIF_1</name>
                  <description>Fault detected (or FERCNFG[CFDFD] is set) during a valid internal RAM or flash read access from the flash memory controller</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FERCNFG</name>
          <description>Flash Error Configuration Register</description>
          <addressOffset>0x2F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xD</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDFDIE</name>
              <description>Platform FlexRAM Double Bit Fault Detect Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDFDIE_0</name>
                  <description>Fault detect interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDFDIE_1</name>
                  <description>Fault detect interrupt enabled. An interrupt request is generated whenever the FERSTAT[PDFDIF] flag is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFDIE</name>
              <description>Platform Flash Double Bit Fault Detect Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFDIE_0</name>
                  <description>Fault detect interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFDIE_1</name>
                  <description>Fault detect interrupt enabled. An interrupt request is generated whenever the FERSTAT[DFDIF] flag is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDFDIE</name>
              <description>Controller FlexRAM Double Bit Fault Detect Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDFDIE_0</name>
                  <description>Fault detect interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDFDIE_1</name>
                  <description>Fault detect interrupt enabled. An interrupt request is generated whenever the FERSTAT[EDFDIF] flag is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDFDIE</name>
              <description>Controller Flash Double Bit Fault Detect Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDFDIE_0</name>
                  <description>Fault detect interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDFDIE_1</name>
                  <description>Fault detect interrupt enabled. An interrupt request is generated whenever the FERSTAT[CDFDIF] flag is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFDFD</name>
              <description>Platform FlexRAM Force Double Bit Fault Detect</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PFDFD_0</name>
                  <description>FERSTAT[PDFDIF] sets only if a fault is detected during a valid FlexRAM or CSE_PRAM read access from the platform flash controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFDFD_1</name>
                  <description>FERSTAT[PDFDIF] sets during any valid FlexRAM or CSE_PRAM read access from the platform flash controller. An interrupt request is generated if the PDFDIE bit is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDFD</name>
              <description>Force Double Bit Fault Detect</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FDFD_0</name>
                  <description>FERSTAT[DFDIF] sets only if a fault is detected during a valid flash read access from the platform flash controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDFD_1</name>
                  <description>FERSTAT[DFDIF] sets during any valid flash read access from the platform flash controller. An interrupt request is generated if the DFDIE bit is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EFDFD</name>
              <description>Controller FlexRAM Force Double Bit Fault Detect</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EFDFD_0</name>
                  <description>FERSTAT[EDFDIF] sets only if a fault is detected during a valid FlexRAM or CSE_PRAM read access from the flash memory controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFDFD_1</name>
                  <description>FERSTAT[EDFDIF] sets during the next FlexRAM or CSE_PRAM read access from the flash memory controller. An interrupt request is generated if the EDFDIE bit is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFDFD</name>
              <description>Controller Flash Force Double Bit Fault Detect</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CFDFD_0</name>
                  <description>FERSTAT[CDFDIF] sets only if a fault is detected during a valid internal RAM or flash read access from the flash memory controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFDFD_1</name>
                  <description>FERSTAT[CDFDIF] sets during the next internal RAM or flash read access from the flash memory controller. An interrupt request is generated if the CDFDIE bit is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
