renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/9_CAN_driver/Examples/CAN_Example3_Transmission_using_Interrupts/Autosar/Mcal/Base/header/S32K144W_M4.svd
        <register>
          <name>ISCR</name>
          <description>Interrupt Status and Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIOC</name>
              <description>FPU Invalid Operation Interrupt Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIOC_0</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIOC_1</name>
                  <description>Interrupt occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDZC</name>
              <description>FPU Divide-by-Zero Interrupt Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FDZC_0</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDZC_1</name>
                  <description>Interrupt occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOFC</name>
              <description>FPU Overflow Interrupt Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FOFC_0</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOFC_1</name>
                  <description>Interrupt occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUFC</name>
              <description>FPU Underflow Interrupt Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FUFC_0</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUFC_1</name>
                  <description>Interrupt occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIXC</name>
              <description>FPU Inexact Interrupt Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIXC_0</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXC_1</name>
                  <description>Interrupt occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIDC</name>
              <description>FPU Input Denormal Interrupt Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIDC_0</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIDC_1</name>
                  <description>Interrupt occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIOCE</name>
              <description>FPU Invalid Operation Interrupt Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIOCE_0</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIOCE_1</name>
                  <description>Enable interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDZCE</name>
              <description>FPU Divide-by-Zero Interrupt Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FDZCE_0</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDZCE_1</name>
                  <description>Enable interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOFCE</name>
              <description>FPU Overflow Interrupt Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FOFCE_0</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOFCE_1</name>
                  <description>Enable interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUFCE</name>
              <description>FPU Underflow Interrupt Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FUFCE_0</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUFCE_1</name>
                  <description>Enable interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIXCE</name>
              <description>FPU Inexact Interrupt Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIXCE_0</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXCE_1</name>
                  <description>Enable interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIDCE</name>
              <description>FPU Input Denormal Interrupt Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIDCE_0</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIDCE_1</name>
                  <description>Enable interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PID</name>
          <description>Process ID Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PID</name>
              <description>M0_PID and M1_PID for MPU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPO</name>
          <description>Compute Operation Control Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPOREQ</name>
              <description>Compute Operation Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPOREQ_0</name>
                  <description>Request is cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPOREQ_1</name>
                  <description>Request Compute Operation.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOACK</name>
              <description>Compute Operation Acknowledge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPOACK_0</name>
                  <description>Compute operation entry has not completed or compute operation exit has completed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPOACK_1</name>
                  <description>Compute operation entry has completed or compute operation exit has not completed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOWOI</name>
              <description>Compute Operation Wakeup On Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPOWOI_0</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPOWOI_1</name>
                  <description>When set, the CPOREQ is cleared on any interrupt or exception vector fetch.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1</dimIndex>
          <name>LMDR%s</name>
          <description>Local Memory Descriptor Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CF0</name>
              <description>Control Field 0 LMDR0[CF0] bit field is Reserved and Read-Only 0 for S32K11x variants.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MT</name>
              <description>Memory Type</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MT_0</name>
                  <description>SRAM_L</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MT_1</name>
                  <description>SRAM_U</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>LOCK</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_0</name>
                  <description>Writes to the LMDRn[7:0] are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_1</name>
                  <description>Writes to the LMDRn[7:0] are ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPW</name>
              <description>LMEM Data Path Width. This field defines the width of the local memory.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPW_2</name>
                  <description>LMEMn 32-bits wide</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPW_3</name>
                  <description>LMEMn 64-bits wide</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WY</name>
              <description>Level 1 Cache Ways</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WY_0</name>
                  <description>No Cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WY_2</name>
                  <description>2-Way Set Associative</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WY_4</name>
                  <description>4-Way Set Associative</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMSZ</name>
              <description>LMEM Size</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LMSZ_0</name>
                  <description>no LMEMn (0 KB)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_1</name>
                  <description>1 KB LMEMn</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_2</name>
                  <description>2 KB LMEMn</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_3</name>
                  <description>4 KB LMEMn</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_4</name>
                  <description>8 KB LMEMn</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_5</name>
                  <description>16 KB LMEMn</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_6</name>
                  <description>32 KB LMEMn</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_7</name>
                  <description>64 KB LMEMn</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_8</name>
                  <description>128 KB LMEMn</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_9</name>
                  <description>256 KB LMEMn</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_10</name>
                  <description>512 KB LMEMn</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_11</name>
                  <description>1024 KB LMEMn</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_12</name>
                  <description>2048 KB LMEMn</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_13</name>
                  <description>4096 KB LMEMn</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_14</name>
                  <description>8192 KB LMEMn</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_15</name>
                  <description>16384 KB LMEMn</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMSZH</name>
              <description>LMEM Size Hole</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LMSZH_0</name>
                  <description>LMEMn is a power-of-2 capacity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZH_1</name>
                  <description>LMEMn is not a power-of-2, with a capacity is 0.75 * LMSZ.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V</name>
              <description>Local Memory Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V_0</name>
                  <description>LMEMn is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1</name>
                  <description>LMEMn is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
